handouts.org
#+TITLE: [Handout] Contributing to the Insights Core Framework
#+DATE: DevConf.in 2019, Bangalore, India
#+Author: Sachin Patil, Vishwanath Jadhav
#+EMAIL: psachin@redhat.com, vjadhav@redhat.com
#+OPTIONS: texht:t
#+OPTIONS: toc:nil email:t
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS:
#+LATEX_HEADER_EXTRA:
#+LaTeX_HEADER: \usepackage[a4paper, total={7in, 10in}]{geometry}
#+LaTeX_HEADER: \usepackage[utf8]{inputenc}
#+LaTeX_HEADER: \usepackage[english]{babel}

#+LaTeX_HEADER: \usepackage{minted}
#+LaTeX_HEADER: \usemintedstyle{emacs}

#+LaTeX_HEADER: \renewcommand{\familydefault}{\rmdefault}
#+LaTeX_HEADER: \usepackage[usenames, dvipsnames]{xcolor}
#+LaTeX_HEADER: \pagenumbering{arabic}
#+LaTeX_HEADER: \usepackage{hyperref}
#+LaTeX_HEADER: \hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan}
#+LaTeX_HEADER: \urlstyle{same}


This handout will guide you in developing and understanding the parser and the
rule(plugin) using the *Insights Core Framework*. The rule uses the simple logic
to analyze the sosreport and verify if the =root= login is enabled in
=/etc/ssh/sshd_config= file. If the =root= is permitted to login to the SSH
server, the rule will respond with the distro name(product) along with the
resolution.

Start by installing the pre-requisites and creating the Python Virtual
environment needed for developing & testing a rule. Once the virtual environment
is ready, create an empty Python file with any name(say =my_plugin.py=) and
start adding the code snippets marked as *CODE* in the python file to develop a
complete rule. You can literally copy-paste the code snippets to get the working
rule.

** Prerequisites
   - GNU/Linux
   - Python 3.6
     - Fedora
       #+BEGIN_SRC shell
         $ sudo dnf install python36
       #+END_SRC

     - CentOS
       #+BEGIN_SRC shell
	 $ sudo yum install epel-release centos-release-scl
	 $ sudo scl enable rh-python36 bash
       #+END_SRC

     - Ubuntu
       #+BEGIN_SRC shell
	 $ sudo apt-get install python3-venv
	 $ pip install wheel
       #+END_SRC

   - =git=[fn:git]
   - =sos-report=
     - Fedora
       #+BEGIN_SRC shell
         $ sudo dnf install sos
       #+END_SRC

     - CentOS/RedHat
       #+BEGIN_SRC shell
         $ sudo yum install sos
       #+END_SRC

     - Ubuntu
       #+BEGIN_SRC shell
         $ sudo apt-get install sosreport
       #+END_SRC

** Setup
   - Setting up a development environment
     #+BEGIN_SRC shell
       $ mkdir ~/insights
       $ cd ~/insights
       # Clone the Insights Core repo
       $ git clone https://github.com/RedHatInsights/insights-core.git
       $ python3.6 -m venv .
       $ source bin/activate
       $ pip install -e insights-core[develop]

       # [Optional] Clone the plugin repo
       $ git clone https://github.com/vishwanathjadhav/analysis-plugins.git
     #+END_SRC

** Sos-report[fn:sr]
   - Generating an Sos archive
     #+BEGIN_SRC shell
       $ sudo sosreport

       # Below command is recommended for this demo.
       $ sudo sosreport -o ssh,systemd,release
     #+END_SRC

** Specs[fn:specs]
   - Raw data in the form of file-content or command output.
     #+BEGIN_SRC shell -n
       # File
       $ cat /etc/lsb-release
       DISTRIB_ID=Ubuntu
       DISTRIB_RELEASE=18.04
       DISTRIB_CODENAME=bionic
       DISTRIB_DESCRIPTION="Ubuntu 18.04.2 LTS"

       # Command output
       $ uname -a
       Linux foobar 5.0.17-200.fc29.x86_64 #1 SMP Mon May...2019 x86_64...GNU/Linux
     #+END_SRC

   - *CODE*: Define a Spec
     #+BEGIN_SRC python -n :tangle my_plugin.py
       """The specs is where you define a path to the file(configuration, log etc.)
       having the content or the command output within the sos-report. The valid path
       can also be a file-system path such as ``/var/log/messages``.
       """
       from insights.specs import Specs
       from insights.core.spec_factory import simple_file


       class SosSpecs(Specs):
	   # sos-archive/etc/lsb-release.

	   # You can safely skip the 'sos-archive/' as the rule will be run against an
	   # archive.
	   lsb_release = simple_file("etc/lsb-release")
     #+END_SRC

** Parser[fn:parser]
   - It structures the raw data(from specs) for further analysis.
   - Example(structured data of =/etc/lsb-release= returned by the parser):
     #+BEGIN_SRC python
       {
	   'product': 'Ubuntu',
	   'version': '18.04'
       }
     #+END_SRC
   - *CODE*: Define a parser
     #+BEGIN_SRC python -n :tangle my_plugin.py
       from insights import Parser, parser
       from insights.parsers import split_kv_pairs


       @parser(SosSpecs.lsb_release)
       class LsbRelease(Parser):
	   def parse_content(self, content):
	       _content = split_kv_pairs(content)
	       self.data = {
		   'product': _content['DISTRIB_ID'],
		   'version': _content['DISTRIB_RELEASE']
	       }

	   @property
	   def product(self):
	       return self.data['product']

	   @property
	   def version(self):
	       return self.data['version']
     #+END_SRC

** Plugin/Rule
