handouts.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-16 Mon 14:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>[Handout] Contributing to the Insights Core Framework</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Sachin Patil, Vishwanath Jadhav" />
</head>
<body>
<div id="content">
<h1 class="title">[Handout] Contributing to the Insights Core Framework</h1>
<p>
This handout will guide you in developing and understanding the parser and the
rule(plugin) using the <b>Insights Core Framework</b>. The rule uses the simple logic
to analyze the sosreport and verify if the <code>root</code> login is enabled in
<code>/etc/ssh/sshd_config</code> file. If the <code>root</code> is permitted to login to the SSH
server, the rule will respond with the distro name(product) along with the
resolution.
</p>

<p>
Start by installing the pre-requisites and creating the Python Virtual
environment needed for developing &amp; testing a rule. Once the virtual environment
is ready, create an empty Python file with any name(say <code>my_plugin.py</code>) and
start adding the code snippets marked as <b>CODE</b> in the python file to develop a
complete rule. You can literally copy-paste the code snippets to get the working
rule.
</p>

<div id="outline-container-org837ad4a" class="outline-2">
<h2 id="org837ad4a"><span class="section-number-2">1</span> Prerequisites</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>GNU/Linux</li>
<li>Python 3.6
<ul class="org-ul">
<li><p>
Fedora
</p>
<div class="org-src-container">
<pre class="src src-shell">$ sudo dnf install python36
</pre>
</div></li>

<li><p>
CentOS
</p>
<div class="org-src-container">
<pre class="src src-shell">$ sudo yum install epel-release centos-release-scl
$ sudo scl enable rh-python36 bash
</pre>
</div></li>

<li><p>
Ubuntu
</p>
<div class="org-src-container">
<pre class="src src-shell">$ sudo apt-get install python3-venv
$ pip install wheel
</pre>
</div></li>
</ul></li>

<li><code>git</code><sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></li>
<li><code>sos-report</code>
<ul class="org-ul">
<li><p>
Fedora
</p>
<div class="org-src-container">
<pre class="src src-shell">$ sudo dnf install sos
</pre>
</div></li>

<li><p>
CentOS/RedHat
</p>
<div class="org-src-container">
<pre class="src src-shell">$ sudo yum install sos
</pre>
</div></li>

<li><p>
Ubuntu
</p>
<div class="org-src-container">
<pre class="src src-shell">$ sudo apt-get install sosreport
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org914c196" class="outline-2">
<h2 id="org914c196"><span class="section-number-2">2</span> Setup</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><p>
Setting up a development environment
</p>
<div class="org-src-container">
<pre class="src src-shell">$ mkdir ~/insights
$ cd ~/insights
<span style="color: #73d216;"># </span><span style="color: #73d216;">Clone the Insights Core repo</span>
$ git clone https://github.com/RedHatInsights/insights-core.git
$ python3.6 -m venv .
$ source bin/activate
$ pip install -e insights-core[develop]

<span style="color: #73d216;"># </span><span style="color: #73d216;">[Optional] Clone the plugin repo</span>
$ git clone https://github.com/vishwanathjadhav/analysis-plugins.git
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org452a0b8" class="outline-2">
<h2 id="org452a0b8"><span class="section-number-2">3</span> Sos-report<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><p>
Generating an Sos archive
</p>
<div class="org-src-container">
<pre class="src src-shell">$ sudo sosreport

<span style="color: #73d216;"># </span><span style="color: #73d216;">Below command is recommended for this demo.</span>
$ sudo sosreport -o ssh,systemd,release
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org3f923b3" class="outline-2">
<h2 id="org3f923b3"><span class="section-number-2">4</span> Specs<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup></h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><p>
Raw data in the form of file-content or command output.
</p>
<div class="org-src-container">
<pre class="src src-shell"><span class="linenr"> 1: </span><span style="color: #73d216;"># </span><span style="color: #73d216;">File</span>
<span class="linenr"> 2: </span>$ cat /etc/lsb-release
<span class="linenr"> 3: </span><span style="color: #fcaf3e;">DISTRIB_ID</span>=Ubuntu
<span class="linenr"> 4: </span><span style="color: #fcaf3e;">DISTRIB_RELEASE</span>=18.04
<span class="linenr"> 5: </span><span style="color: #fcaf3e;">DISTRIB_CODENAME</span>=bionic
<span class="linenr"> 6: </span><span style="color: #fcaf3e;">DISTRIB_DESCRIPTION</span>=<span style="color: #e9b96e;">"Ubuntu 18.04.2 LTS"</span>
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span><span style="color: #73d216;"># </span><span style="color: #73d216;">Command output</span>
<span class="linenr"> 9: </span>$ uname -a
<span class="linenr">10: </span>Linux foobar 5.0.17-200.fc29.x86_64 <span style="color: #73d216;">#</span><span style="color: #73d216;">1 SMP Mon May...2019 x86_64...GNU/Linux</span>
</pre>
</div></li>

<li><p>
<b>CODE</b>: Define a Spec
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="linenr"> 1: </span><span style="color: #e9b96e;">"""The specs is where you define a path to the file(configuration, log etc.)</span>
<span class="linenr"> 2: </span><span style="color: #e9b96e;">having the content or the command output within the sos-report. The valid path</span>
<span class="linenr"> 3: </span><span style="color: #e9b96e;">can also be a file-system path such as ``/var/log/messages``.</span>
<span class="linenr"> 4: </span><span style="color: #e9b96e;">"""</span>
<span class="linenr"> 5: </span><span style="color: #b4fa70;">from</span> insights.specs <span style="color: #b4fa70;">import</span> Specs
<span class="linenr"> 6: </span><span style="color: #b4fa70;">from</span> insights.core.spec_factory <span style="color: #b4fa70;">import</span> simple_file
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span><span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">SosSpecs</span>(Specs):
<span class="linenr">10: </span>    <span style="color: #73d216;"># </span><span style="color: #73d216;">sos-archive/etc/lsb-release.</span>
<span class="linenr">11: </span>
<span class="linenr">12: </span>    <span style="color: #73d216;"># </span><span style="color: #73d216;">You can safely skip the 'sos-archive/' as the rule will be run against an</span>
<span class="linenr">13: </span>    <span style="color: #73d216;"># </span><span style="color: #73d216;">archive.</span>
<span class="linenr">14: </span>    <span style="color: #fcaf3e;">lsb_release</span> = simple_file(<span style="color: #e9b96e;">"etc/lsb-release"</span>)
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org72b851a" class="outline-2">
<h2 id="org72b851a"><span class="section-number-2">5</span> Parser<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup></h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>It structures the raw data(from specs) for further analysis.</li>
<li><p>
Example(structured data of <code>/etc/lsb-release</code> returned by the parser):
</p>
<div class="org-src-container">
<pre class="src src-python">{
    <span style="color: #e9b96e;">'product'</span>: <span style="color: #e9b96e;">'Ubuntu'</span>,
    <span style="color: #e9b96e;">'version'</span>: <span style="color: #e9b96e;">'18.04'</span>
}
</pre>
</div></li>
<li><p>
<b>CODE</b>: Define a parser
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="linenr"> 1: </span><span style="color: #b4fa70;">from</span> insights <span style="color: #b4fa70;">import</span> Parser, parser
<span class="linenr"> 2: </span><span style="color: #b4fa70;">from</span> insights.parsers <span style="color: #b4fa70;">import</span> split_kv_pairs
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #8cc4ff;">@parser</span>(SosSpecs.lsb_release)
<span class="linenr"> 6: </span><span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">LsbRelease</span>(Parser):
<span class="linenr"> 7: </span>    <span style="color: #b4fa70;">def</span> <span style="color: #fce94f;">parse_content</span>(<span style="color: #b4fa70;">self</span>, content):
<span class="linenr"> 8: </span>        <span style="color: #fcaf3e;">_content</span> = split_kv_pairs(content)
<span class="linenr"> 9: </span>        <span style="color: #b4fa70;">self</span>.data = {
<span class="linenr">10: </span>            <span style="color: #e9b96e;">'product'</span>: _content[<span style="color: #e9b96e;">'DISTRIB_ID'</span>],
<span class="linenr">11: </span>            <span style="color: #e9b96e;">'version'</span>: _content[<span style="color: #e9b96e;">'DISTRIB_RELEASE'</span>]
<span class="linenr">12: </span>        }
<span class="linenr">13: </span>
<span class="linenr">14: </span>    @<span style="color: #e090d7;">property</span>
<span class="linenr">15: </span>    <span style="color: #b4fa70;">def</span> <span style="color: #fce94f;">product</span>(<span style="color: #b4fa70;">self</span>):
<span class="linenr">16: </span>        <span style="color: #b4fa70;">return</span> <span style="color: #b4fa70;">self</span>.data[<span style="color: #e9b96e;">'product'</span>]
<span class="linenr">17: </span>
<span class="linenr">18: </span>    @<span style="color: #e090d7;">property</span>
<span class="linenr">19: </span>    <span style="color: #b4fa70;">def</span> <span style="color: #fce94f;">version</span>(<span style="color: #b4fa70;">self</span>):
<span class="linenr">20: </span>        <span style="color: #b4fa70;">return</span> <span style="color: #b4fa70;">self</span>.data[<span style="color: #e9b96e;">'version'</span>]
</pre>
</div></li>
</ul>
</div>
</div>
