handouts.org
*** Conditions[fn:condition]
    - *CODE*: Analyzing the data from the parser
      #+BEGIN_SRC python -n :tangle my_plugin.py
	"""The (structured)data from the parsers is analyzed using the ``@condition`` &
	``@incident`` decorators. The function decorated with the ``@condition`` should
	return the value which will be used by the ``@rule`` to finally bind all the
	rule logic.
	"""
	from insights.core.plugins import condition
	from insights.parsers.ssh import SshDConfig
	from insights.parsers.systemd.unitfiles import ListUnits
	from insights.parsers.redhat_release import RedhatRelease

	@condition(SshDConfig)
	def check_permit_root_login(sshd):
	    """Return True if 'PermitRootLogin yes' in /etc/ssh/sshd_config.
	    """
	    if sshd.get('permitrootlogin'):
		return sshd.get_values('permitrootlogin')[0] == 'yes'


	@condition(ListUnits)
	def is_sshd_running(units):
	    """ Return True if ``sshd.service`` is running.
	    """
	    return units.is_running('sshd.service') or units.is_running('ssh.service')


	@condition([RedhatRelease, LsbRelease])
	def get_release(redhat_release, lsb_release):
	    """Return the product name.

	    RedhatRelease will parse the data from ``/etc/redhat-release``
	    LsbRelease will parse the data from ``/etc/lsb-release``
	    """
	    if redhat_release:
		return redhat_release.product
	    if lsb_release:
		return lsb_release.product
       #+END_SRC

*** The response[fn:rule]
    - *CODE*: The =@rule= will have a final logic which will decide the response of the
      plugin.
      #+BEGIN_SRC python -n :tangle my_plugin.py
	"""The function decorated with the ``@rule`` decorator is where all the logic to
	detect an issue exist. The logic for this rule is as follows:

	Logic:
	1. check_permit_root_login
	2. is_sshd_running
	3. get_release

	if (2 & 3):
	    if 1:
		# The root user login is permitted
	    # The root user login is disabled

	"""
	from insights.core.plugins import make_fail, make_pass, rule


	@rule(check_permit_root_login, is_sshd_running, get_release)
	def report(root_login, sshd, release):
	    if sshd and release:
		if root_login:
		    # The issue is detected.
		    return make_fail('SSHD_ROOT_LOGIN_PERMITTED',
				     os=release)
		# The issue does not exist.
		return make_pass('SSHD_ROOT_LOGIN_DISABLED',
				 os=release)

      #+END_SRC

*** Embedded content[fn:ec]
    - *CODE* Use the =CONTENT= attribute to render the response
      #+BEGIN_SRC python -n :tangle my_plugin.py
	fail_message = """
	The root user can login on this {{os}} host because the 'PermitRootLogin' is set
	to 'yes' in /etc/ssh/sshd_config.

	It is recommended to set 'PermitRootLogin' to 'prohibit-password',
	'forced-commands-only' or 'no'.

	Please refer the manpage of SSHD_CONFIG for more info:
	$ man 5 ssh_config
	"""

	pass_message = """
	The root user cannot login on this {{os}} host.
	"""

	CONTENT = {
	    'SSHD_ROOT_LOGIN_PERMITTED': fail_message,
	    'SSHD_ROOT_LOGIN_DISABLED': pass_message
	}
      #+END_SRC

