handouts.html

<div id="outline-container-orga93bb66" class="outline-2">
<h2 id="orga93bb66"><span class="section-number-2">6</span> Plugin/Rule</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgc664899" class="outline-3">
<h3 id="orgc664899"><span class="section-number-3">6.1</span> Conditions<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup></h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li><p>
<b>CODE</b>: Analyzing the data from the parser
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="linenr"> 1: </span><span style="color: #e9b96e;">"""The (structured)data from the parsers is analyzed using the ``@condition`` &amp;</span>
<span class="linenr"> 2: </span><span style="color: #e9b96e;">``@incident`` decorators. The function decorated with the ``@condition`` should</span>
<span class="linenr"> 3: </span><span style="color: #e9b96e;">return the value which will be used by the ``@rule`` to finally bind all the</span>
<span class="linenr"> 4: </span><span style="color: #e9b96e;">rule logic.</span>
<span class="linenr"> 5: </span><span style="color: #e9b96e;">"""</span>
<span class="linenr"> 6: </span><span style="color: #b4fa70;">from</span> insights.core.plugins <span style="color: #b4fa70;">import</span> condition
<span class="linenr"> 7: </span><span style="color: #b4fa70;">from</span> insights.parsers.ssh <span style="color: #b4fa70;">import</span> SshDConfig
<span class="linenr"> 8: </span><span style="color: #b4fa70;">from</span> insights.parsers.systemd.unitfiles <span style="color: #b4fa70;">import</span> ListUnits
<span class="linenr"> 9: </span><span style="color: #b4fa70;">from</span> insights.parsers.redhat_release <span style="color: #b4fa70;">import</span> RedhatRelease
<span class="linenr">10: </span>
<span class="linenr">11: </span><span style="color: #8cc4ff;">@condition</span>(SshDConfig)
<span class="linenr">12: </span><span style="color: #b4fa70;">def</span> <span style="color: #fce94f;">check_permit_root_login</span>(sshd):
<span class="linenr">13: </span>    <span style="color: #e9b96e;">"""Return True if 'PermitRootLogin yes' in /etc/ssh/sshd_config.</span>
<span class="linenr">14: </span><span style="color: #e9b96e;">    """</span>
<span class="linenr">15: </span>    <span style="color: #b4fa70;">if</span> sshd.get(<span style="color: #e9b96e;">'permitrootlogin'</span>):
<span class="linenr">16: </span>        <span style="color: #b4fa70;">return</span> sshd.get_values(<span style="color: #e9b96e;">'permitrootlogin'</span>)[0] == <span style="color: #e9b96e;">'yes'</span>
<span class="linenr">17: </span>
<span class="linenr">18: </span>
<span class="linenr">19: </span><span style="color: #8cc4ff;">@condition</span>(ListUnits)
<span class="linenr">20: </span><span style="color: #b4fa70;">def</span> <span style="color: #fce94f;">is_sshd_running</span>(units):
<span class="linenr">21: </span>    <span style="color: #e9b96e;">""" Return True if ``sshd.service`` is running.</span>
<span class="linenr">22: </span><span style="color: #e9b96e;">    """</span>
<span class="linenr">23: </span>    <span style="color: #b4fa70;">return</span> units.is_running(<span style="color: #e9b96e;">'sshd.service'</span>) <span style="color: #b4fa70;">or</span> units.is_running(<span style="color: #e9b96e;">'ssh.service'</span>)
<span class="linenr">24: </span>
<span class="linenr">25: </span>
<span class="linenr">26: </span><span style="color: #8cc4ff;">@condition</span>([RedhatRelease, LsbRelease])
<span class="linenr">27: </span><span style="color: #b4fa70;">def</span> <span style="color: #fce94f;">get_release</span>(redhat_release, lsb_release):
<span class="linenr">28: </span>    <span style="color: #e9b96e;">"""Return the product name.</span>
<span class="linenr">29: </span>
<span class="linenr">30: </span><span style="color: #e9b96e;">    RedhatRelease will parse the data from ``/etc/redhat-release``</span>
<span class="linenr">31: </span><span style="color: #e9b96e;">    LsbRelease will parse the data from ``/etc/lsb-release``</span>
<span class="linenr">32: </span><span style="color: #e9b96e;">    """</span>
<span class="linenr">33: </span>    <span style="color: #b4fa70;">if</span> redhat_release:
<span class="linenr">34: </span>        <span style="color: #b4fa70;">return</span> redhat_release.product
<span class="linenr">35: </span>    <span style="color: #b4fa70;">if</span> lsb_release:
<span class="linenr">36: </span>        <span style="color: #b4fa70;">return</span> lsb_release.product
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org91c33b6" class="outline-3">
<h3 id="org91c33b6"><span class="section-number-3">6.2</span> The response<sup><a id="fnr.6" class="footref" href="#fn.6">6</a></sup></h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li><p>
<b>CODE</b>: The <code>@rule</code> will have a final logic which will decide the response of the
plugin.
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="linenr"> 1: </span><span style="color: #e9b96e;">"""The function decorated with the ``@rule`` decorator is where all the logic to</span>
<span class="linenr"> 2: </span><span style="color: #e9b96e;">detect an issue exist. The logic for this rule is as follows:</span>
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #e9b96e;">Logic:</span>
<span class="linenr"> 5: </span><span style="color: #e9b96e;">1. check_permit_root_login</span>
<span class="linenr"> 6: </span><span style="color: #e9b96e;">2. is_sshd_running</span>
<span class="linenr"> 7: </span><span style="color: #e9b96e;">3. get_release</span>
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span><span style="color: #e9b96e;">if (2 &amp; 3):</span>
<span class="linenr">10: </span><span style="color: #e9b96e;">    if 1:</span>
<span class="linenr">11: </span><span style="color: #e9b96e;">        # The root user login is permitted</span>
<span class="linenr">12: </span><span style="color: #e9b96e;">    # The root user login is disabled</span>
<span class="linenr">13: </span>
<span class="linenr">14: </span><span style="color: #e9b96e;">"""</span>
<span class="linenr">15: </span><span style="color: #b4fa70;">from</span> insights.core.plugins <span style="color: #b4fa70;">import</span> make_fail, make_pass, rule
<span class="linenr">16: </span>
<span class="linenr">17: </span>
<span class="linenr">18: </span><span style="color: #8cc4ff;">@rule</span>(check_permit_root_login, is_sshd_running, get_release)
<span class="linenr">19: </span><span style="color: #b4fa70;">def</span> <span style="color: #fce94f;">report</span>(root_login, sshd, release):
<span class="linenr">20: </span>    <span style="color: #b4fa70;">if</span> sshd <span style="color: #b4fa70;">and</span> release:
<span class="linenr">21: </span>        <span style="color: #b4fa70;">if</span> root_login:
<span class="linenr">22: </span>            <span style="color: #73d216;"># </span><span style="color: #73d216;">The issue is detected.</span>
<span class="linenr">23: </span>            <span style="color: #b4fa70;">return</span> make_fail(<span style="color: #e9b96e;">'SSHD_ROOT_LOGIN_PERMITTED'</span>,
<span class="linenr">24: </span>                             os=release)
<span class="linenr">25: </span>        <span style="color: #73d216;"># </span><span style="color: #73d216;">The issue does not exist.</span>
<span class="linenr">26: </span>        <span style="color: #b4fa70;">return</span> make_pass(<span style="color: #e9b96e;">'SSHD_ROOT_LOGIN_DISABLED'</span>,
<span class="linenr">27: </span>                         os=release)
<span class="linenr">28: </span>
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org831def8" class="outline-3">
<h3 id="org831def8"><span class="section-number-3">6.3</span> Embedded content<sup><a id="fnr.7" class="footref" href="#fn.7">7</a></sup></h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li><p>
<b>CODE</b> Use the <code>CONTENT</code> attribute to render the response
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="linenr"> 1: </span><span style="color: #fcaf3e;">fail_message</span> = <span style="color: #e9b96e;">"""</span>
<span class="linenr"> 2: </span><span style="color: #e9b96e;">The root user can login on this {{os}} host because the 'PermitRootLogin' is set</span>
<span class="linenr"> 3: </span><span style="color: #e9b96e;">to 'yes' in /etc/ssh/sshd_config.</span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #e9b96e;">It is recommended to set 'PermitRootLogin' to 'prohibit-password',</span>
<span class="linenr"> 6: </span><span style="color: #e9b96e;">'forced-commands-only' or 'no'.</span>
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span><span style="color: #e9b96e;">Please refer the manpage of SSHD_CONFIG for more info:</span>
<span class="linenr"> 9: </span><span style="color: #e9b96e;">$ man 5 ssh_config</span>
<span class="linenr">10: </span><span style="color: #e9b96e;">"""</span>
<span class="linenr">11: </span>
<span class="linenr">12: </span><span style="color: #fcaf3e;">pass_message</span> = <span style="color: #e9b96e;">"""</span>
<span class="linenr">13: </span><span style="color: #e9b96e;">The root user cannot login on this {{os}} host.</span>
<span class="linenr">14: </span><span style="color: #e9b96e;">"""</span>
<span class="linenr">15: </span>
<span class="linenr">16: </span><span style="color: #fcaf3e;">CONTENT</span> = {
<span class="linenr">17: </span>    <span style="color: #e9b96e;">'SSHD_ROOT_LOGIN_PERMITTED'</span>: fail_message,
<span class="linenr">18: </span>    <span style="color: #e9b96e;">'SSHD_ROOT_LOGIN_DISABLED'</span>: pass_message
<span class="linenr">19: </span>}
</pre>
</div></li>
</ul>
</div>
</div>
</div>
