handouts.org
** Investigating the sos-report[fn:analysis]
   - Run the plugin against the sos-report using:
     #+BEGIN_SRC shell
       $ insights-run -p my_plugin.py /path/to/sos-report.tar.xz
     #+END_SRC

   - Sample output
     #+BEGIN_SRC text -n
       $ insights-run -p check_ssh_root_login.py sosreport_fedora_sshd_root_login.tar.xz
       ---------
       Progress:
       ---------
       F

       --------------
       Rules Executed
       --------------
       [FAIL] check_ssh_root_login.report
       ----------------------------------

       The root user can login on this Fedora host because the 'PermitRootLogin' is set
       to 'yes' in /etc/ssh/sshd_config.

       It is recommended to set 'PermitRootLogin' to 'prohibit-password',
       'forced-commands-only' or 'no'.

       Please refer the manpage of SSHD_CONFIG for more info:
       $ man 5 ssh_config


       ----------------------
       Rule Execution Summary
       ----------------------
       Passed      : 0
       Failed      : 1
       Info        : 0
       Missing Deps: 0
       Fingerprint : 0
       Metadata    : 0
       Metadata Key: 0
       Exceptions  : 0
     #+END_SRC


** [WIP]Debugging[fn:inspect]
   - Specs
     #+BEGIN_SRC shell -n
       $ insights-inspect insights.specs.default.DefaultSpecs.redhat_release sosreport_xxx.tar.xz

       IPython Console Usage Info:

       Enter 'redhat_release.' and tab to get a list of properties
       Example:
       In [1]: redhat_release.<property_name>
       Out[1]: <property value>

       To exit ipython enter 'exit' and hit enter or use 'CTL D'

       Starting IPython Interpreter Now

       In [1]: redhat_release.content
       Out[1]: ['Fedora release 29 (Twenty Nine)']

       In [2]: redhat_release.path
       Out[2]: '/tmp/insights-rdhi53c6/sosreport_fedora_sshd_root_login/etc/redhat-release'

       In [3]: redhat_release.file_name
       Out[3]: 'redhat-release'
     #+END_SRC

   - Parser:
     #+BEGIN_SRC shell -n
       $ insights-inspect insights.parsers.redhat_release.RedhatRelease sosreport_xxx.tar.xz

       IPython Console Usage Info:

       Enter 'RedhatRelease.' and tab to get a list of properties
       Example:
       In [1]: RedhatRelease.<property_name>
       Out[1]: <property value>

       To exit ipython enter 'exit' and hit enter or use 'CTL D'

       Starting IPython Interpreter Now

       In [1]: RedhatRelease.raw
       Out[1]: 'Fedora release 29 (Twenty Nine)'

       In [2]: RedhatRelease.parsed
       Out[2]: {'product': 'Fedora', 'version': '29', 'code_name': 'Twenty Nine'}

       In [3]: RedhatRelease.product
       Out[3]: 'Fedora'

       In [4]: RedhatRelease.version
       Out[4]: '29'
     #+END_SRC

** End[fn:end][fn:test][fn:edu]
** Footnotes
[fn:git] https://git-scm.com/book/en/v2
[fn:sr] https://github.com/sosreport/sos/wiki#for-users
[fn:specs] https://insights-core.readthedocs.io/en/latest/api.html#specification-factories
[fn:parser] https://insights-core.readthedocs.io/en/latest/api.html#parsers
[fn:condition] https://insights-core.readthedocs.io/en/latest/api_index.html?highlight=%40condition#insights.core.plugins.condition
[fn:rule] https://insights-core.readthedocs.io/en/latest/api.html?highlight=%40rule#rule-plugins
[fn:ec] https://insights-core.readthedocs.io/en/latest/embedded_content.html
[fn:analysis] https://insights-core.readthedocs.io/en/latest/manpages/insights-run.html
[fn:inspect] https://insights-core.readthedocs.io/en/latest/manpages/insights-inspect.html
[fn:end] Made with Love, LaTeX and GNU Emacs.
[fn:test] The code snippets are tested on /Fedora 29/ & /Ubuntu 10.04/.
[fn:edu] For Education purpose only.
