handouts.html

<div id="outline-container-org8eda917" class="outline-2">
<h2 id="org8eda917"><span class="section-number-2">7</span> Investigating the sos-report<sup><a id="fnr.8" class="footref" href="#fn.8">8</a></sup></h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><p>
Run the plugin against the sos-report using:
</p>
<div class="org-src-container">
<pre class="src src-shell">$ insights-run -p my_plugin.py /path/to/sos-report.tar.xz
</pre>
</div></li>

<li><p>
Sample output
</p>
<div class="org-src-container">
<pre class="src src-text"><span class="linenr"> 1: </span>$ insights-run -p check_ssh_root_login.py sosreport_fedora_sshd_root_login.tar.xz
<span class="linenr"> 2: </span>---------
<span class="linenr"> 3: </span>Progress:
<span class="linenr"> 4: </span>---------
<span class="linenr"> 5: </span>F
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>--------------
<span class="linenr"> 8: </span>Rules Executed
<span class="linenr"> 9: </span>--------------
<span class="linenr">10: </span>[FAIL] check_ssh_root_login.report
<span class="linenr">11: </span>----------------------------------
<span class="linenr">12: </span>
<span class="linenr">13: </span>The root user can login on this Fedora host because the 'PermitRootLogin' is set
<span class="linenr">14: </span>to 'yes' in /etc/ssh/sshd_config.
<span class="linenr">15: </span>
<span class="linenr">16: </span>It is recommended to set 'PermitRootLogin' to 'prohibit-password',
<span class="linenr">17: </span>'forced-commands-only' or 'no'.
<span class="linenr">18: </span>
<span class="linenr">19: </span>Please refer the manpage of SSHD_CONFIG for more info:
<span class="linenr">20: </span>$ man 5 ssh_config
<span class="linenr">21: </span>
<span class="linenr">22: </span>
<span class="linenr">23: </span>----------------------
<span class="linenr">24: </span>Rule Execution Summary
<span class="linenr">25: </span>----------------------
<span class="linenr">26: </span>Passed      : 0
<span class="linenr">27: </span>Failed      : 1
<span class="linenr">28: </span>Info        : 0
<span class="linenr">29: </span>Missing Deps: 0
<span class="linenr">30: </span>Fingerprint : 0
<span class="linenr">31: </span>Metadata    : 0
<span class="linenr">32: </span>Metadata Key: 0
<span class="linenr">33: </span>Exceptions  : 0
</pre>
</div></li>
</ul>
</div>
</div>


<div id="outline-container-org626ec10" class="outline-2">
<h2 id="org626ec10"><span class="section-number-2">8</span> [WIP]Debugging<sup><a id="fnr.9" class="footref" href="#fn.9">9</a></sup></h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><p>
Specs
</p>
<div class="org-src-container">
<pre class="src src-shell"><span class="linenr"> 1: </span>$ insights-inspect insights.specs.default.DefaultSpecs.redhat_release sosreport_<span style="color: #ee82ee; background-color: #333333;">xxx.tar.xz</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span>IPython Console Usage Info:
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>Enter <span style="color: #e9b96e;">'redhat_release.'</span> and tab to get a list of properties
<span class="linenr"> 6: </span>Example:
<span class="linenr"> 7: </span>In [1]: redhat_release.&lt;property_name&gt;
<span class="linenr"> 8: </span>Out[1]: &lt;property value&gt;
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>To exit ipython enter <span style="color: #e9b96e;">'exit'</span> and hit enter or use <span style="color: #e9b96e;">'CTL D'</span>
<span class="linenr">11: </span>
<span class="linenr">12: </span>Starting IPython Interpreter Now
<span class="linenr">13: </span>
<span class="linenr">14: </span>In [1]: redhat_release.content
<span class="linenr">15: </span>Out[1]: [<span style="color: #e9b96e;">'Fedora release 29 (Twenty Nine)'</span>]
<span class="linenr">16: </span>
<span class="linenr">17: </span>In [2]: redhat_release.path
<span class="linenr">18: </span>Out[2]: <span style="color: #e9b96e;">'/tmp/insights-rdhi53c6/sosreport_fedora_sshd_root_login/etc/redhat-rele</span><span style="color: #ee82ee; background-color: #333333;">ase'</span>
<span class="linenr">19: </span>
<span class="linenr">20: </span>In [3]: redhat_release.file_name
<span class="linenr">21: </span>Out[3]: <span style="color: #e9b96e;">'redhat-release'</span>
</pre>
</div></li>

<li><p>
Parser:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span class="linenr"> 1: </span>$ insights-inspect insights.parsers.redhat_release.RedhatRelease sosreport_xxx.t<span style="color: #ee82ee; background-color: #333333;">ar.xz</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span>IPython Console Usage Info:
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>Enter <span style="color: #e9b96e;">'RedhatRelease.'</span> and tab to get a list of properties
<span class="linenr"> 6: </span>Example:
<span class="linenr"> 7: </span>In [1]: RedhatRelease.&lt;property_name&gt;
<span class="linenr"> 8: </span>Out[1]: &lt;property value&gt;
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>To exit ipython enter <span style="color: #e9b96e;">'exit'</span> and hit enter or use <span style="color: #e9b96e;">'CTL D'</span>
<span class="linenr">11: </span>
<span class="linenr">12: </span>Starting IPython Interpreter Now
<span class="linenr">13: </span>
<span class="linenr">14: </span>In [1]: RedhatRelease.raw
<span class="linenr">15: </span>Out[1]: <span style="color: #e9b96e;">'Fedora release 29 (Twenty Nine)'</span>
<span class="linenr">16: </span>
<span class="linenr">17: </span>In [2]: RedhatRelease.parsed
<span class="linenr">18: </span>Out[2]: {<span style="color: #e9b96e;">'product'</span>: <span style="color: #e9b96e;">'Fedora'</span>, <span style="color: #e9b96e;">'version'</span>: <span style="color: #e9b96e;">'29'</span>, <span style="color: #e9b96e;">'code_name'</span>: <span style="color: #e9b96e;">'Twenty Nine'</span>}
<span class="linenr">19: </span>
<span class="linenr">20: </span>In [3]: RedhatRelease.product
<span class="linenr">21: </span>Out[3]: <span style="color: #e9b96e;">'Fedora'</span>
<span class="linenr">22: </span>
<span class="linenr">23: </span>In [4]: RedhatRelease.version
<span class="linenr">24: </span>Out[4]: <span style="color: #e9b96e;">'29'</span>
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orgf623edd" class="outline-2">
<h2 id="orgf623edd"><span class="section-number-2">9</span> End<sup><a id="fnr.10" class="footref" href="#fn.10">10</a></sup><sup>, </sup><sup><a id="fnr.11" class="footref" href="#fn.11">11</a></sup><sup>, </sup><sup><a id="fnr.12" class="footref" href="#fn.12">12</a></sup></h2>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://git-scm.com/book/en/v2">https://git-scm.com/book/en/v2</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://github.com/sosreport/sos/wiki#for-users">https://github.com/sosreport/sos/wiki#for-users</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
<a href="https://insights-core.readthedocs.io/en/latest/api.html#specification-factories">https://insights-core.readthedocs.io/en/latest/api.html#specification-factories</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
<a href="https://insights-core.readthedocs.io/en/latest/api.html#parsers">https://insights-core.readthedocs.io/en/latest/api.html#parsers</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5">5</a></sup> <div class="footpara"><p class="footpara">
<a href="https://insights-core.readthedocs.io/en/latest/api_index.html?highlight=@condition#insights.core.plugins.condition">https://insights-core.readthedocs.io/en/latest/api_index.html?highlight=@condition#insights.core.plugins.condition</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6">6</a></sup> <div class="footpara"><p class="footpara">
<a href="https://insights-core.readthedocs.io/en/latest/api.html?highlight=@rule#rule-plugins">https://insights-core.readthedocs.io/en/latest/api.html?highlight=@rule#rule-plugins</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.7" class="footnum" href="#fnr.7">7</a></sup> <div class="footpara"><p class="footpara">
<a href="https://insights-core.readthedocs.io/en/latest/embedded_content.html">https://insights-core.readthedocs.io/en/latest/embedded_content.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.8" class="footnum" href="#fnr.8">8</a></sup> <div class="footpara"><p class="footpara">
<a href="https://insights-core.readthedocs.io/en/latest/manpages/insights-run.html">https://insights-core.readthedocs.io/en/latest/manpages/insights-run.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.9" class="footnum" href="#fnr.9">9</a></sup> <div class="footpara"><p class="footpara">
<a href="https://insights-core.readthedocs.io/en/latest/manpages/insights-inspect.html">https://insights-core.readthedocs.io/en/latest/manpages/insights-inspect.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.10" class="footnum" href="#fnr.10">10</a></sup> <div class="footpara"><p class="footpara">
Made with Love, LaTeX and GNU Emacs.
</p></div></div>

<div class="footdef"><sup><a id="fn.11" class="footnum" href="#fnr.11">11</a></sup> <div class="footpara"><p class="footpara">
The code snippets are tested on <i>Fedora 29</i> &amp; <i>Ubuntu 10.04</i>.
</p></div></div>

<div class="footdef"><sup><a id="fn.12" class="footnum" href="#fnr.12">12</a></sup> <div class="footpara"><p class="footpara">
For Education purpose only.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: DevConf.in 2019, Bangalore, India</p>
<p class="author">Author: Sachin Patil, Vishwanath Jadhav</p>
<p class="email">Email: <a href="mailto:psachin@redhat.com">psachin@redhat.com</a>, <a href="mailto:vjadhav@redhat.com">vjadhav@redhat.com</a></p>
<p class="date">Created: 2019-09-16 Mon 14:54</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
